In [2]:
#pip install pandas-summary

In [1]:
import pandas as pd
from pandas_summary import DataFrameSummary

import numpy as np

### Series

In [3]:
# Creating a series from array
data = np.array(['g','e','e','k','s'])
 
ser = pd.Series(data)
print(ser)

0    g
1    e
2    e
3    k
4    s
dtype: object

In [4]:
# a simple list
list = ['g', 'e', 'e', 'k', 's']
  
# create series form a list
ser = pd.Series(list)
print(ser)

0    g
1    e
2    e
3    k
4    s
dtype: object

In [5]:
ser.index

RangeIndex(start=0, stop=5, step=1)

In [6]:
ser.values

array(['g', 'e', 'e', 'k', 's'], dtype=object)

In [8]:
type(ser.values)

numpy.ndarray

In [10]:
#list(ser.values)

### DataFrame

In [3]:
# Define a dictionary containing employee data
data = {'Name':['Jai', 'Princi', 'Gaurav', 'Anuj'],
        'Age':[27, 24, 22, 32],
        'Address':['Delhi', 'Kanpur', 'Allahabad', 'Kannauj'],
        'Qualification':['Msc', 'MA', 'MCA', 'Phd']}
print(data)

{'Name': ['Jai', 'Princi', 'Gaurav', 'Anuj'], 'Age': [27, 24, 22, 32], 'Address': ['Delhi', 'Kanpur', 'Allahabad', 'Kannauj'], 'Qualification': ['Msc', 'MA', 'MCA', 'Phd']}

In [4]:
# Convert the dictionary into DataFrame 
df = pd.DataFrame(data)

In [5]:
df

     Name  Age    Address Qualification
0     Jai   27      Delhi           Msc
1  Princi   24     Kanpur            MA
2  Gaurav   22  Allahabad           MCA
3    Anuj   32    Kannauj           Phd

In [6]:
df[ df.index == 2 ]

     Name  Age    Address Qualification
2  Gaurav   22  Allahabad           MCA

In [7]:
df.index == 2

array([False, False,  True, False])

In [8]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [9]:
#columns 
df['Name'] # alternative df.Name

0       Jai
1    Princi
2    Gaurav
3      Anuj
Name: Name, dtype: object

In [10]:
type(df['Name'])

pandas.core.series.Series

In [11]:
df.columns

Index(['Name', 'Age', 'Address', 'Qualification'], dtype='object')

In [23]:
df.columns=['New_Name', 'Age', 'Address', 'Qualification']
df

  New_Name  Age    Address Qualification
0      Jai   27      Delhi           Msc
1   Princi   24     Kanpur            MA
2   Gaurav   22  Allahabad           MCA
3     Anuj   32    Kannauj           Phd

In [24]:
df.rename(columns={'New_Name': 'Full_Name'})

  Full_Name  Age    Address Qualification
0       Jai   27      Delhi           Msc
1    Princi   24     Kanpur            MA
2    Gaurav   22  Allahabad           MCA
3      Anuj   32    Kannauj           Phd

Filtering

In [38]:
df[(df['Age']>24) | (df['Qualification'] == 'Msc')]

  New_Name  Age  Address Qualification
0      Jai   27    Delhi           Msc
3     Anuj   32  Kannauj           Phd

In [39]:
df[(df['Age']>24) & (df['Qualification'] == 'Msc')]

  New_Name  Age Address Qualification
0      Jai   27   Delhi           Msc

Dataframe description

In [14]:
#df = pd.read_csv('../.csv')
df.head()
df.sample(2)
df.shape
df.info()
df[ df['Age'] > 30 ]

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   NEW_Name       4 non-null      object
 1   Age            4 non-null      int64
 2   Address        4 non-null      object
 3   Qualification  4 non-null      object
dtypes: int64(1), object(3)
memory usage: 256.0+ bytes

  NEW_Name  Age  Address Qualification
3     Anuj   32  Kannauj           Phd

In [15]:
df['Age'].value_counts()

22    1
32    1
27    1
24    1
Name: Age, dtype: int64

In [ ]:
#.map() .apply()

In [40]:
#from pandas_summary import DataFrameSummary
#df.columns_types
#df.columns_stats

In [ ]:
#.value_counts(dropna=False)
#.value_counts(dropna=False, normalize=True)

In [41]:
df.fillna(-1).info() #fill NA with -1

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
NEW_Name         4 non-null object
Age              4 non-null int64
Address          4 non-null object
Qualification    4 non-null object
dtypes: int64(1), object(3)
memory usage: 208.0+ bytes

In [ ]:
#if 'Age' in df: del df['Age']